# 1.1 - html
# Создать каталог, а в нем 4 файла index1.html, index2.html, index3.html, index4.html
# файлы должны содержать ссылки друг на друга: 2 файла должны содержать абсолютные ссылки, а 2 относительные

# 1.2 - html
# Создать форму по отправке обратной связи на сайте.
# Необходимые поля: имя, фамилия, комментарий

# 2.1 - flask
# добавить route + view для отображения текущей даты

# 2.2 - flask
# создать онлайн калькулятор:
# - добавить обработку запросов формата
# <number>/<operator>/<number>
#
# примеры:
# 3/mul/15 > 45
# 5/sub/4 > 1

# 2.3 - flask
# При запросе по урлу /word/[word], в случае если длина слова четна - выводит строку,
# содержащую все нечетные элементы строки (abcde -> ace). В ином случае просто выводит слово.
