# 1. создать таблицы (колонки по вашему желанию, но их должно быть достаточно для запросов, описанных ниже):
# - пользователь
# - книга
# - жанр
#
# 2. добавить в каждую по несколько записей записей
# получить всех пользователей с указанным именем
# получить всех пользователей младше 25
# получить всех пользователей в возрасте от 15 до 18
# получить все книги, название которых начинается на Harry
# получить все жанры, которые находятся в указанном массиве

# часть связанную с sql и ручным созданием таблиц коммитить в репозиторий не обязательно,
# но все должно быть реализовано, используя sqlalchemy

# 3. а теперь добавьте интерфейс для CRUD операций с вашими таблицами:
# возможность создать новую запись используя консоль
# возможность обновить запись / записи
# возможность удалить запись
# возможность сделать выборку данных (*можно просто выборку без условий, но будет круто если вы добавите возможность
# указывать фильтр для данных)
