# Создать таблицу Учебной группы с помощью sqlalchemy.
#
# Создать таблицу Студент с помощью sqlalchemy.
# Студент должен быть связан с Учебной группой.
#
# Создать произвольное кол-во групп и добавить в них студентов.
#
# Создать таблицу журнала посещаемости с помощью sqlalchemy.
# В журнале ведется информация по: дате занятия, группе, студенту и статусу: присутствовал / не присутствовал.
#
# Получить кол-во присутствующих и отстутствующих студентов каждой группы за определенную дату.
# Получить кол-во присутствующих и отстутствующих студентов каждой группы за каждую дату занятия.
#
# Создать таблицу Книга с помощью sqlalchemy. Книга может быть взята в чтение несколькими студентами
# в разные промежутки времени.
# Создать таблицу со связью многие ко многим чтобы в зависимости от времени каждый студент мог взять в
# пользование книгу.
#
# Создать 5 книг. Получить всех студентов и добавить каждому студенту эти пять книг.
